[
  {
    "name": "Rose Bouquet",
    "timeRequired": "1-2 hours per rose",
    "level": "Intermediate",
    "description": "Create a stunning DIY rose bouquet with small and medium crochet roses, matching buds, sepals, and leaves. \\nPerfect for gifts or decorations. This pattern is based on a detailed YouTube tutorial, so make sure to follow \\nalong visually for the best results!\\n\\nTip: Mix and match rose sizes and yarn colours for a more dynamic bouquet.",
    "materials": [
      "Cotton or acrylic yarn (red, pink, green, etc.)",
      "3.0 mm - 4.0 mm crochet hook",
      "Tapestry needle",
      "Scissors",
      "Thin floral wire",
      "Hot glue gun",
      "Floral tape or yarn for wrapping stem"
    ],
    "patternSteps": [
      "1. Small Rose:\\nFoundation chain: Ch 23\\nRow 1: Skip 3 ch, *3 dc in 4th ch, 1 sc in next ch*, repeat to end\\nRow 2: Ch 2, turn, *1 dc, 2 dc in same st, 1 dc, ss, ch 1*, repeat\\nFasten off",
      "2. Small Bud/Sepal:\\nMagic ring, ch 1\\nRnd 1: 5 sc, ss, ch 1\\nRnd 2: 2 sc in each st (10), ss, ch 1\\nRnd 3: 1 sc in each st (10), ss\\nRnd 4: *ch 5, skip 1, ss in next 2, 1 sc, 1 hdc, skip 1, ss*, repeat 5 times\\nFasten off",
      "3. Medium Rose:\\nFoundation chain: Ch 47\\nRow 1: Skip 1, 1 hdc in each ch (46)\\nRow 2: Ch 5, turn, 1 dc in first st, *skip 2, (1 dc + ch 3 + 1 dc) in 3rd st*, repeat\\nRow 3: Ch 3, turn, *7 dc in ch-3 space, 1 sc in triangle*, end with 7 dc, 1 sc, ss\\nFasten off",
      "4. Medium Bud/Sepal:\\nMagic ring, ch 2\\nRnd 1: 6 dc in ring, ss\\nRnd 2: *Ch 7, skip 1, 1 ss, 1 sc, 1 hdc, 1 dc in next 2 sts, 1 tc, ss in next st*, repeat 5 times\\nFasten off",
      "5. Leaves:\\nCh 10, insert thin wire through 10th ch, fold in half\\nFirst side: Skip 1 ch, 1 sc, 1 hdc, 1 dc in next 5, 1 hdc, 3 sc in same stitch (turn)\\nSecond side: 1 hdc, 1 dc in next 5, 1 hdc, 1 sc, ss\\nFasten off",
      "6. Assembling the Roses:\\nStep 1: Glue one side of rose to stem, wrap it around, gluing bottom edges\\nStep 2: Slide leaf/sepal onto stem, glue middle of leaves to bottom\\nStep 3: Wrap stem with yarn/floral tape, add leaves while wrapping down\\nOptional: Mix sizes and colors to create a full bouquet"
    ],
    "image": "https://fnauma.github.io/patternpage/images/rosebouqet.png"
  },
  {
    "name": "Beginner's Basic Sweater",
    "timeRequired": "Varies (beginner-friendly)",
    "level": "Beginner",
    "description": "This is a straight-forward and basic knitting pattern for a sweater made out of four panels (two sleeves, and identical front and back panels). Written from a beginner to beginners, with simple step-by-step guidance. Measurements and stitch counts are based on my first sweater, so feel free to adjust as needed.",
    "materials": [
      "Yarn of your choice (sweater weight recommended)",
      "Knitting needles appropriate for your yarn size",
      "Tapestry needle for sewing",
      "Scissors"
    ],
    "patternSteps": [
      "Measurements:\\nFront & Back Panels - Length: 20 inches, Width: 21 inches\\nSleeves - Length: 18.5 inches, Width: 12 inches (6 inches when folded)",
      "Front and Back Panels:\\n1. Make a slip knot and cast on until you have the desired width (64 stitches in this example).\\n2. Knit rows of the stockinette stitch until the panel reaches the desired length (90 rows here, alternating 1 row knit and 1 row purl).\\n3. Cast/bind off all stitches, leaving a long tail for sewing the shoulder seams.",
      "Sleeves:\\n1. Make a slip knot and cast on until you have the desired width (42 stitches in this example).\\n2. Knit rows of the stockinette stitch until the panel reaches the desired length (80 rows here, alternating 1 row knit and 1 row purl).\\n3. Cast/bind off all stitches, leaving a tail as long as your sleeve for sewing.\\n4. Sew the sides of each sleeve together.",
      "Joining Panels:\\n1. Start sewing the bottom edges of the front and back panels together until you reach the sleeve opening.\\n2. Attach the sleeves to the armholes, sewing all the way around.\\n3. Repeat for the other sleeve.\\n4. Sew the top of the front and back panels together at the shoulders (about 4.5 inches in on both sides)."
    ],
    "image": "https://fnauma.github.io/patternpage/images/beginners_basic_sweater.png"
  },
  {
  "name": "Teddy Bear",
  "timeRequired": "4-6 hours",
  "level": "Beginner",
  "description": "Crochet a soft and cozy teddy bear with an optional hat, bow, and cherries! 🧸 This is a no-magic-ring pattern (uses a fake magic ring alternative). Follow the free video tutorial alongside this written pattern for the best results. Perfect as a handmade gift or a cuddly decoration. Share your finished bear with #crochetwithmahum!",
  "materials": [
    "Worsted weight yarn (brown/cream for body, color of choice for hat & bow, red for cherries, green for stem)",
    "3.0 mm - 4.0 mm crochet hook",
    "Polyester stuffing",
    "Tapestry needle",
    "Scissors",
    "Stitch markers",
    "Optional: safety eyes or black yarn for embroidery"
  ],
  "patternSteps": [
    "1. Head:\\nRnd 1: 8 sc\\nRnd 2: 2 sc in each st (16)\\nRnd 3: *1 sc, inc* (24)\\nRnd 4: *2 sc, inc* (32)\\nRnd 5: *3 sc, inc* (40)\\nRnd 6-13: sc around (40)\\nRnd 14: *3 sc, dec* (32)\\nRnd 15: *2 sc, dec* (24)\\nRnd 16: *1 sc, dec* (16)\\nRnd 17: dec around (8). Fasten off and stuff.",
    "Face Patch:\\nRnd 1: 8 sc\\nRnd 2: 2 sc in each st (16). Fasten off, embroider the nose, and sew onto the head.",
    "2. Hat:\\nRnd 1: 8 sc\\nRnd 2: 2 sc in each st (16)\\nRnd 3: *1 sc, inc* (24)\\nRnd 4: *2 sc, inc* (32)\\nRnd 5: *3 sc, inc* (40)\\nRnd 6: *4 sc, inc* (48)\\nRnd 7-13: sc around (48)\\nRnd 14: *3 sc, dec* (tighter fit)\\nRnd 15: sc around. Fasten off.",
    "3. Body:\\nRnd 1: 8 sc\\nRnd 2: 2 sc in each st (16)\\nRnd 3: *1 sc, inc* (24)\\nRnd 4: *2 sc, inc* (32)\\nRnd 5: *3 sc, inc* (40)\\nRnd 6-13: sc around (40)\\nRnd 14: *3 sc, dec* (32)\\nRnd 15: sc around (32)\\nRnd 16: *2 sc, dec* (24). Stuff firmly.",
    "4. Arms (make 2):\\nRnd 1: 6 sc\\nRnd 2: 2 sc in each st (12)\\nRnd 3-8: sc around (12)\\nRnd 9: dec around (6)\\nRnd 10: sc around (6). Fasten off, lightly stuff.",
    "5. Legs (make 2):\\nRnd 1: 8 sc\\nRnd 2: 2 sc in each st (16)\\nRnd 3-5: sc around (16). Fasten off and stuff.",
    "6. Ears (make 2):\\nRnd 1: 8 sc\\nRnd 2: 2 sc in each st (16)\\nRnd 3: sc around (16). Flatten and sew onto head.",
    "7. Cherries & Bow:\\nCherry (make 2): Rnd 1: 6 sc\\nRnd 2: *1 sc, inc* (9)\\nRnd 3: *1 sc, dec* (6). Fasten off and close.\\nStem: Ch 70+, fasten off. Sew cherries to ends and tie around bear as a bow."
  ],
  "image": "https://fnauma.github.io/patternpage/images/teddy_bear.png"
},
{
  "name": "Echoes Pullover",
  "timeRequired": "Varies",
  "level": "Intermediate",
  "description": "The Echoes Pullover is the cozy sister design to the popular Echoes Cardigan! Using Lion Brand Mandala yarn in vibrant, color-changing shades (shown in 'Warlock'), this pullover combines comfort with style. Featuring a deep V-neck, relaxed fit, and beautiful textured stitches, it works up quicker than the cardigan since there are no pocket panels. Adjustable in length and sleeve size, the Echoes Pullover is perfect for layering year-round. Includes a full video tutorial for extra guidance!",
  "materials": [
    "Light (3) Weight Yarn – Lion Brand Mandala in 'Warlock' (3–6 skeins depending on size, approx. 1570–3000 yards)",
    "H/5.0 mm crochet hook",
    "Yarn needle",
    "Scissors",
    "Stitch markers (3)"
  ],
  "patternSteps": [
    "Gauge: 16 stitches x 8.5 rows = 4 × 4” (blocked). Make a swatch of 25 Fsc, then work rows 1–10 of the back panel to check gauge.",
    "Sizes: Written for 9 sizes XS–5X. Follow row/ stitch counts in parentheses throughout.",
    "Notes:\\n• Pullover is worked in separate panels (Back, Front, Sleeves).\\n• Worked bottom up for body, top down for sleeves.\\n• Ch 3 counts as 1 Dc, Ch 4 counts as 1 Dc + Ch Sp.\\n• Adjust length by adding/removing rows in multiples of 2.\\n• Oversized drop-shoulder style: sleeve length may vary with size.\\n• Includes special textured stitch (described in pattern).",
    "Back Panel:\\nRow 1: Fsc 81(89–145) or chain + Sc alternative.\\nRow 2–4: Establish stitch pattern with Dc clusters, Sc, and Special Stitch.\\nRows 5–43(45–51): Repeat Rows 3–4. Fasten off.",
    "Front Panel:\\nWork same as back until neckline shaping at Row 35(37–43).\\nSplit for shoulders, shaping neckline with decreases while continuing stitch pattern.\\nFinish both shoulders separately, leaving center sts unworked. Fasten off.",
    "Sleeves (make 2):\\nRow 1: Fsc 49(53–81).\\nRows 2–35: Repeat established stitch pattern.\\nRows 36–39: Work decreases and Sc/Hdc rows to shape cuff. Fasten off with long tail for seaming.",
    "Assembly:\\nBlock panels to measurements.\\nSeam shoulders together.\\nAttach sleeves to body, aligning sleeve center with shoulder seam.\\nFold pullover RS facing and seam sleeves + sides from cuff to hem.",
    "Neckline Trim:\\nJoin yarn at back neckline, Sc evenly across back, down neckline edge, across unworked sts, and up other side. Work approx. 3 Sc per row edge. Sl St to join. Fasten off.\\nWeave in ends.",
    "Video Tutorial: A full step-by-step video is available for beginners or extra guidance."
  ],
  "image": "https://fnauma.github.io/patternpage/images/echoes_pullover.png"
},
{
  "name": "Boxy Blooms Pullover",
  "timeRequired": "Varies (Intermediate project)",
  "level": "Intermediate",
  "description": "The Boxy Blooms Pullover is a lightweight, textured crochet top worked with Lion Brand 24/7 Cotton DK. Designed with a cropped, boxy fit and featuring puff stitches, front post stitches, and a unique neckline, this pullover is modern, airy, and customizable. Its length can be adjusted easily by adding or removing row repeats before neckline shaping. Perfect for warmer weather and layering.",
  "materials": [
    "Light (3) Weight Yarn – Lion Brand 24/7 Cotton DK in Cacao, 3(3, 4, 4, 4, 5, 5) skeins or 650–1160 yards",
    "G/4.00mm crochet hook",
    "Yarn needle",
    "Scissors",
    "Measuring tape",
    "Stitch markers (3)"
  ],
  "patternSteps": [
    "Gauge: 18 sts x 8 rows = 4 × 4” (worked from Back Panel Rows 1–9). Swatch will be larger; measure within 4” square.",
    "Sizes: Written for 7 sizes (XS, S, M/L, XL, 2X, 3X/4X, 5X).",
    "Notes: • Ch-3 counts as Dc, Ch-5 counts as Dc + 2 Chs. • Chains within rows count toward stitch counts. • When instructed to work into a stitch from 2 rows below, insert hook around previous Ch-3, pulling loop up to row height. • Cropped length by default; adjust by adding/removing multiples of 4 rows to both front and back panels. • Oversized drop-shoulder fit.",
    "Back Panel: Ch 84(96–156) foundation. Rows 1–6 establish mesh, Fpdc, puff stitches, and textured repeats. Continue pattern through Row 36(40–52), adjusting length as desired. Fasten off.",
    "Front Panel: Work Rows 1–25(25–41) same as Back. Mark center Ch-3 sp for neckline split. Shape shoulders separately.",
    "Right Shoulder: Rows 26–36 shape neckline with repeats of Rows 3–6, decreasing with slip stitches and leaving stitches unworked at neckline edge. Fasten off, leaving tail for seaming.",
    "Left Shoulder: Mirror right shoulder. Work Rows 26–36, shaping neckline symmetrically. Fasten off, leaving tail for seaming.",
    "Sleeves (make 2): Ch 60(66–96). Work Rows 1–6 of back panel pattern (57–93 sts). Row 7 adds picot edging across sleeve. Fasten off, leaving long tail for seaming.",
    "Assembly: Block panels. Seam shoulders together. Attach sleeves at shoulder seams, aligning centers. Seam underarms and sides of pullover.",
    "Neckline Setup: With RS facing, join yarn at neckline. Work single crochet edging evenly around neckline (approx. 98 sts).",
    "Collar: Work in turned rows between stitch markers. Row 1 Dc across (67 sts). Row 2 mesh (Dc + Ch 1). Row 3 puff stitches. Rows 4–5 repeat mesh + puff. Rows 6–7 Sc to finish. Work Sc trim evenly down V-neck edges and around. Fasten off.",
    "Bottom Trim: With RS facing, join yarn at side seam. Work 1 round of Sc evenly around hem (162–306 sts). Fasten off and weave in ends.",
    "Finishing: Block if needed. Ensure all seams are secure. Weave in ends."
  ],
  "image": "https://fnauma.github.io/patternpage/images/boxy_blooms_pullover.png"
}

]
